Model: "cnn__non_pruned"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
sequential (Sequential)      multiple                  24528     
_________________________________________________________________
flatten (Flatten)            multiple                  0         
_________________________________________________________________
sequential_1 (Sequential)    multiple                  136714    
=================================================================
Total params: 161,242
Trainable params: 161,242
Non-trainable params: 0
_________________________________________________________________
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_block (ConvBlock)       multiple                  224       
_________________________________________________________________
conv_block_1 (ConvBlock)     multiple                  1168      
_________________________________________________________________
conv_block_2 (ConvBlock)     multiple                  4640      
_________________________________________________________________
conv_block_3 (ConvBlock)     multiple                  18496     
=================================================================
Total params: 24,528
Trainable params: 24,528
Non-trainable params: 0
_________________________________________________________________
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                multiple                  131584    
_________________________________________________________________
dropout (Dropout)            multiple                  0         
_________________________________________________________________
dense_1 (Dense)              multiple                  5130      
_________________________________________________________________
dropout_1 (Dropout)          multiple                  0         
=================================================================
Total params: 136,714
Trainable params: 136,714
Non-trainable params: 0
_________________________________________________________________
